{
    "Doris Driscoll": "An elderly woman who becomes infected by the Mind Flayer, leading to strange behavior.",
    "Heather Holloway": "A lifeguard at Hawkins Pool who falls victim to the Mind Flayer.",
    "Hawkins Head of Security": "The chief of security at Hawkins Lab, responsible for maintaining order.",
    "Larry Kline": "The corrupt mayor of Hawkins, involved in shady dealings with the Russians.",
    "Joyce Byers": "A determined mother who will stop at nothing to protect her sons, Will and Jonathan.",
    "Billy's Mother": "Billy Hargrove’s estranged mother, whose absence deeply affected him.",
    "Dottie": "A minor character in Hawkins, not much is known about her.",
    "Funshine": "A member of Kali’s gang, known for his tough demeanor and loyalty.",
    "Susan Hargrove": "Billy and Max’s mother, married to Neil Hargrove.",
    "Steve Harrington": "Former high school king turned beloved 'babysitter' of the group.",
    "Jim Hopper": "Chief of Hawkins Police and father figure to Eleven, known for his gruff exterior and big heart.",
    "Neil Hargrove": "Billy’s abusive and controlling father.",
    "Barbara Holland": "Nancy Wheeler’s best friend who mysteriously disappeared in Season 1.",
    "Sara Hopper": "Jim Hopper’s deceased daughter, whose loss deeply impacted him.",
    "Jonathan Byers": "A quiet and artistic teen, older brother to Will Byers.",
    "Elevator Scientist": "One of the scientists involved in experiments at Hawkins Lab.",
    "Scott Clarke": "The science teacher at Hawkins Middle School who encourages the kids’ curiosity.",
    "Evil Russian": "A generic term for the antagonists working for the Soviet Union in Hawkins.",
    "Stacey Albright": "A student at Hawkins High School, a minor character.",
    "Ray Carroll": "A former orderly at Hawkins Lab, connected to Kali’s past.",
    "Diane": "Hopper’s love interest, mentioned in his letters.",
    "Benny Hammond": "Kind diner owner who helps Eleven, but is tragically killed early in Season 1.",
    "Lead Scientist": "The leader of scientific experiments at Hawkins Lab, often seen with Dr. Brenner.",
    "Carol Perkins": "Tommy H.’s girlfriend and former friend of Steve Harrington.",
    "Mr. Holland": "Barbara Holland’s father, who seeks answers about her disappearance.",
    "Martin Brenner": "The scientist responsible for Eleven’s experiments and the events at Hawkins Lab.",
    "Alexei": "A Russian scientist who loves cherry Slurpees and provides crucial information to the group.",
    "Lonnie Byers": "Will and Jonathan’s estranged father, largely absent from their lives.",
    "Eleven": "A girl with psychokinetic abilities, raised in Hawkins Lab and a core member of the group.",
    "Becky Ives": "Terry Ives’ sister, who tries to help Eleven understand her past.",
    "Cynthia": "A minor character in Hawkins.",
    "Earl": "A minor character in Hawkins.",
    "Agent Repairman": "A government agent involved in the operations of Hawkins Lab.",
    "Axel": "A rebellious member of Kali’s gang.",
    "Will Byers": "A sensitive and artistic boy who gets trapped in the Upside Down.",
    "Grigori": "A Russian hitman working in Hawkins, reminiscent of The Terminator.",
    "Billy Hargrove": "Max’s troubled stepbrother who becomes a vessel for the Mind Flayer.",
    "Dustin Henderson": "A witty and inventive member of the group, known for his lovable personality.",
    "Marsha Holland": "Barbara Holland’s mother, devastated by her daughter’s disappearance.",
    "Lead Agent": "A high-ranking government agent involved in the Hawkins Lab cover-up.",
    "James Dante": "A minor character in Hawkins.",
    "The Demogorgon": "A terrifying creature from the Upside Down that preys on Hawkins.",
    "Gary": "The medical examiner who performs Will’s 'autopsy'.",
    "Keith": "The quirky arcade worker with a crush on Nancy.",
    "Phil Callahan": "An officer at the Hawkins Police Department.",
    "Russell Coleman": "A minor character in Hawkins.",
    "Claudia Henderson": "Dustin’s caring and slightly eccentric mother.",
    "Murray Bauman": "A conspiracy theorist who helps uncover the truth about the Russian threat.",
    "Florence": "Secretary at Hawkins Police Department.",
    "Janet Holloway": "Heather’s mother and a victim of the Mind Flayer.",
    "Eugene McCorkle": "A minor character in Hawkins.",
    "Holly Wheeler": "Mike and Nancy Wheeler’s younger sister.",
    "Bob Newby": "Joyce’s kind-hearted boyfriend who sacrifices himself to save others.",
    "Kali Prasad": "Also known as Eight, she has psychic abilities and a connection to Eleven.",
    "Shepard": "A scientist who explores the Upside Down.",
    "Tommy Hagan": "Steve Harrington’s former best friend and a school bully.",
    "Lucas Sinclair": "A brave and strategic member of the group.",
    "Karen Wheeler": "Mother of Nancy, Mike, and Holly Wheeler.",
    "Nerdy Tech": "A technician working at Hawkins Lab.",
    "Nancy Wheeler": "A determined and resourceful journalist, sister of Mike Wheeler.",
    "Nicole": "A student at Hawkins High School.",
    "Mrs. Sinclair": "Lucas Sinclair’s caring and supportive mother.",
    "Mews": "Dustin’s pet cat, tragically eaten by D’Artagnan.",
    "Marissa": "A minor character in Hawkins.",
    "Sam Owens": "A doctor who helps contain the threat from the Upside Down.",
    "Max Mayfield": "A tomboyish skateboarder who becomes part of the group.",
    "Calvin Powell": "An officer at Hawkins Police Department.",
    "Mrs. Walsh": "Troy’s mother.",
    "Donald Melvald": "Joyce Byers’ boss at Melvald’s General Store.",
    "David O'Bannon": "A minor character in Hawkins.",
    "Ozerov": "A Russian scientist working on the Gate in Hawkins.",
    "Mr. Sinclair": "Lucas Sinclair’s strict but loving father.",
    "Suzie": "Dustin’s long-distance girlfriend who loves 'The NeverEnding Story'.",
    "Tina": "A student known for hosting parties in Hawkins.",
    "Erica Sinclair": "Lucas Sinclair’s smart and sassy younger sister.",
    "Mike Wheeler": "A natural leader and Eleven’s boyfriend.",
    "Merrill Wright": "A minor character in Hawkins.",
    "Brenda Wood": "A news anchor in Hawkins.",
    "Russian Agent": "A Soviet operative involved in covert missions in Hawkins.",
    "Stepanov": "A Russian scientist assisting in experiments at Hawkins.",
    "Mick": "A minor character in Hawkins.",
    "Robin Buckley": "Steve Harrington’s intelligent and quick-witted co-worker.",
    "Troy Walsh": "A school bully who torments the kids, particularly Mike and friends."
}
